Repository: common-repository/woo-order-product-codes
Catalog: languages/wopc-*.po
Languages: ro_ro

# Post Type Campaign General Name
source: Campaigns
ro_ro: Campanii coduri

# Post Type Campaign Singular Name
source: Campaign
ro_ro: Campanii coduri

# Post Type Campaign Menu Name
source: Campaigns
ro_ro: Campanii coduri

# Post Type Campaign Admin Bar
source: Campaigns
ro_ro: Campanii coduri

# Post Type Order Code General Name
source: Order Code
ro_ro: Coduri Promoționale

# Post Type Order Code Singular Name
source: Order Code
ro_ro: Cod Promoțional

# Post Type Order Code Menu Name
source: Order Codes
ro_ro: Coduri Promoționale

# Post Type Order Code Admin Bar
source: Order Codes
ro_ro: Coduri Promoționale

source: Remove product: %s
ro_ro: Șterge produs: %s

source: Applied products
ro_ro: Produle la care se aplică

source: How many codes to send on order
ro_ro: Câte coduri să trimită la comandă

source: Fixed number of codes per order
ro_ro: Număr de coduri fixe pe Comandă

source: Variable number of codes per order
ro_ro: Număr variabil de coduri pe Comandă

source: 1 Code every x value from order total
ro_ro: 1 Cod la fiecare x valoare din total comandă

source: Code Pattern
ro_ro: Șablon Cod

source: Preview
ro_ro: Previzualizare

source: Example: [a:1-3][C:YOUR FIXED CHARS][n:4][lL:4][n:1-3]<br /><br />Usage: Inside you need structure like: <strong>[type:length]</strong><br /><br />Type can be:<br />l: lower case letters<br />L: upper case letters<br />c: special characters<br />n: numbers<br />a: all above<br />C: your choosen string<br /><br /><strong>Type identifiers</strong> can be combined. Example: <strong>nL</strong><br /><br /><strong>Length</strong> can be <strong>fixed number</strong> or choose <strong>random from a range</strong>. Example: <strong>2</strong> OR <strong>9</strong> OR <strong>1-10</strong>
ro_ro: Exemplu: [a:1-3][C:YOUR FIXED CHARS][n:4][lL:4][n:1-3]<br /><br />Cum se folosește: În interior structura trebuie să fie: <strong>[type:length]</strong><br /><br />Type poate sa fie:<br />l: litere mici<br />L: litere mari<br />c: caractere speciale<br />n: numere<br />a: toate enumerate mai sus<br />C: valoare fixă personalizată<br /><br /><strong>Identificatoarele de tipuri</strong> se pot combina. Exemplu: <strong>nL</strong><br /><br /><strong>Length</strong> poate fi <strong>număr fix</strong> sau se alege <strong>aleator dintr-o limită</strong>. Exermplu: <strong>2</strong> SAU <strong>9</strong> SAU <strong>1-10</strong>

source: Email From
ro_ro: Câmpul Expeditor din mesaj email

source: Email Name
ro_ro: Numele de la cine e trimis email-ul

source: Email Subject
ro_ro: Subiect mesaj

source: Email Message
ro_ro: Conținutul mesajului email

source: Email message that will be sent foreach order.<br />HTML is allowed.<br /><br />Use:<br /><strong>{{site_name}}</strong> - insert site name<br /><strong>{{site_email}}</strong> - insert site email address<br /><strong>{{codes}}</strong> - insert code(s) list<br /><strong>{{order_id}}</strong> - order id<br /><strong>{{order_date}}</strong> - date of order<br /><strong>{{campaign_name}}</strong> - campaign name
ro_ro: Conținutul mesajului va fi trimis la fiecare Comandă.<br />Se poate folosi HTML.<br /><br />Use:<br /><strong>{{site_name}}</strong> - afișează numele site-ului<br /><strong>{{site_email}}</strong> - afișează email-ul setat din Administrare<br /><strong>{{codes}}</strong> - afișează lista de coduri<br /><strong>{{order_id}}</strong> - afișează id-ul comenzii<br /><strong>{{order_date}}</strong> - afișează data comenzii<br /><strong>{{campaign_name}}</strong> - afișează numele Campaniei

source: Campaign
ro_ro: Campanii

source: Campaigns
ro_ro: Campanii

source: Archive Campaigns
ro_ro: Campanii vechi

source: Campaign Attributes
ro_ro: Atributele Campaniei

source: Parent Campaign:
ro_ro: Campania părinte

source: All Campaigns
ro_ro: Toate Campaniile

source: Add New Campaign
ro_ro: Adaugă Campanie nouă

source: Add New
ro_ro: Adaugă încă una

source: New Campaign
ro_ro: Campanie nouă

source: Edit Campaign
ro_ro: Editează Campania

source: Update Campaigns
ro_ro: Salvează Campania

source: View all Campaigns
ro_ro: Vezi toate Campaniile

source: View Campaigns
ro_ro: Vezi Campaniile

source: Search Campaigns
ro_ro: Caută Campanii

source: Not found
ro_ro: Nu s-a găsit

source: Not found in Trash
ro_ro: Nu s-a găsit nimic in Coș

source: Featured Image
ro_ro: Imagine principală

source: Set featured image
ro_ro: Setează imagine principală

source: Remove featured image
ro_ro: Șterge Imagine principală

source: Use as featured image
ro_ro: Folosește ca și imagine principală

source: Insert into Campaigns
ro_ro: Adaugă in Campanii

source: Uploaded to this Code
ro_ro: Adăugata la acest Cod

source: Campaigns list
ro_ro: Lista Campanii

source: Campaigns list navigation
ro_ro: Navigația listei de Campanii

source: Filter Campaigns list
ro_ro: Filtre listă Campanii

source: Post type for WOPC Campaigns
ro_ro: Post type pentru Campanii comanda WOPC

source: Order Codes
ro_ro: Coduri Promoționale

source: Archive Order Codes
ro_ro: Coduri vechi

source: Codes Attributes
ro_ro: Atribute Coduri

source: All Codes
ro_ro: Toate Codurile

source: Add New Code
ro_ro: Adaugă Cod nou

source: New Code
ro_ro: Cod nou

source: Edit Code
ro_ro: Editează Cod

source: Update Codes
ro_ro: Salveză Codul

source: View all Codes
ro_ro: Vezi toate codurile

source: View Codes
ro_ro: Vezi Codurile

source: Search Codes
ro_ro: Caută Coduri

source: Insert into Codes
ro_ro: Adaugă in Coduri

source: Codes list
ro_ro: Listă Coduri

source: Codes list navigation
ro_ro: Navigația listei de Coduri

source: Filter Codes list
ro_ro: Filtre listă Coduri

source: Post type for WOPC Order codes
ro_ro: Post type pentru Coduri Promoționale WOPC.

source: Setting value %s does not exist.
ro_ro: Setarea %s nu există.

source: Product Codes
ro_ro: Coduri Produs

source: Product Codes settings
ro_ro: Setări Coduri Produs

source: Settings Saved
ro_ro: Setările au fost salvate.

source: General Settings
ro_ro: Setări generale

source: Module functionality enabled
ro_ro: Activează funcționalitate modul

source: Send code on order status
ro_ro: Trimite Coduri la statusul

source: Select multiple status by holding CTRL. <strong>This will be applied for future orders.</strong>
ro_ro: Selectează stări mai multe ținând apăsat CTRL. <strong>Se aplică comenzilor din viitor.</strong>

source: Cancel code on order status
ro_ro: Șterge Codul când comanda are statusul

source: Enable code resent
ro_ro: Activează retrimitere codurilor

source: After order status is set to a Cancel state, enable codes resend.
ro_ro: Dupa ce s-a schimbat statul comenzii într-o valoare Anulat, se permite retrimiterea codurile când statusul comenzii este unul de trimitere.

source: Disable admin notification
ro_ro: Ascunde notificarea din Administrare

source: On uninstall remove all data
ro_ro: La dezinstalare șterge datele

source: On uninstall remove all Codes, Orders, Campaigns data created by module. <strong>THIS IS IRREVERSIBLE. USE IT WITH CARE.</strong>
ro_ro: La ștergere modul, se șterg toate Codurile, datele Comenzilor si Campaniile create de către modul. <strong>ACEST PROCES ESTE IREVERSIBVIL. FOLOSEȘTE-L CU ATENȚIE.</strong>

source: Save Settings
ro_ro: Salveză setări

source: Pattern [%s] has incorrect type.
ro_ro: Șablonul [%s] are tip incorect.

source: Pattern [%s] has incorrect length value.
ro_ro: Șablonul [%s] are valoarea de mărime incorectă.

source: Pattern [%s] has invalid characters in declaration.
ro_ro: Șablonul [%s] are caractere incorecte in definiție.

source: Pattern %s has incorrect structure. Pattern must end with ].
ro_ro: Șablonul [%s] are structură incorectă. Trebuie să se termine cu ].

source: Incorrect number of [] charcaters in pattern %s.
ro_ro: Număr incorect de caractere [] in Șablonul %s

source: Pattern is empty.
ro_ro: Șablonul este gol.

source: Pattern is invalid type.
ro_ro: Șablonul are tip incorect

source: You are not authorized to access this link.
ro_ro: Nu ai acces la acest link.

source: Configure
ro_ro: Configurează

source: Please activate Woocommerce
ro_ro: Vă rugăm să activați Woocommerce

source: Email could not be sent from server.
ro_ro: Email-ul nu a putut fi trimis de server.

source: Your feedback is important! Please leave us your feeling about the module.
ro_ro: Feedback-ul tău este important! Te rog sa ne lași un feedback despre acest modul.

source: Feedback sent. Thank you!
ro_ro: Feedback-ul a fost trimis. Mulțumesc!

source: Feedback could not be sent. Email is not working.
ro_ro: Feedback-ul nu a fost trimis. Nu s-a putut trimite email-ul.

source: Your email
ro_ro: Email-ul tău

source: Your name
ro_ro: Numele tău

source: Note the plugin experience(1-10)
ro_ro: Dă o notă experienței tale cu plugin-ul(1-10)

source: Your message
ro_ro: Mesajul tău

source: Leave us a message about what can be improved or added
ro_ro: Lasă un feedback despre ce se poate imbunătați sau adăuga

source: Send feedback
ro_ro: Trimite feedback

source: Your data will not be processed in any form.
ro_ro: Datele trimise nu vor fi procesate in nici un fel.
